index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>MultiselectJS</title>
<!-- 2015-08-21 Fri 20:43 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Jaakko Järvi" />
</head>
<body>
<div id="content">
<h1 class="title">MultiselectJS</h1>
<p>
MultiselectJS is a library for implementing selection of multiple elements from visual collections with a mouse and keyboard.
</p>

<p>
The library&rsquo;s multiselection abstraction is not bound to a widget or
control; it can be applied to any context.  To implement
multiselection, the application programmers main tasks are to:
</p>

<ul class="org-ul">
<li>implement a <i>selection geometry</i> object that determines how mouse
points indicate a set of elements (and a few other things);</li>
<li>implement functions to visualize selected and not-selected
elements and cursors used in selecting elements; and</li>
<li>bind mouse and keyboard events to MultiselectJS&rsquo;s functions.</li>
</ul>

<p>
The library provides a rich multiselection feature, including mouse
and keyboard selection so that they are compatible with each other,
undoing and redoing selections, selecting based on a predicate, and
changing selection geometries on the fly.  The different aspecs of
multiselection are showcased in <a href="examples/demo/multiselect-demo.html">a demo application</a>.
</p>

<p>
Our <a href="docs/tutorial/tutorial.html">tutorial</a> describes the basic concepts of multiselection and shows
step-by-step how to apply the library in a few example situations.
</p>

<p>
The manuscript <i>One Way to Select Many</i>, by Jaakko Järvi and Sean
Parent, is a full account of the motivations behind MultiselectJS and the
theory of of multi-selection that its design is based on. As the
manuscript is currently under review, it is not publicly available at
the moment. Please <a href="mailto:jarvij@gmail.com">request a copy by email</a>.
</p>

<p>
The <a href="https://github.com/HotDrink/multiselectjs">project&rsquo;s GitHub page</a> contains the sources and the releases.
</p>
</div>
</body>
</html>
